In [3]:
import os

mingw_path = 'C:\\Program Files\\mingw-w64\\x86_64-5.3.0-posix-seh-rt_v4-rev0\\mingw64\\bin'

os.environ['PATH'] = mingw_path + ';' + os.environ['PATH']

# https://www.youtube.com/watch?v=k51sX_ApQYU 架設XGBOOST

In [7]:
from sklearn import preprocessing
import xgboost as xgb


import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

%matplotlib inline

In [1]:
from sklearn.base import clone
from itertools import combinations
import numpy as np
from sklearn.metrics import accuracy_score
from sklearn.model_selection import train_test_split

In [8]:
train = pd.read_csv("train.csv")
test = pd.read_csv('test.csv')
submit = pd.read_csv('gender_submission.csv')

In [9]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
PassengerId    418 non-null int64
Pclass         418 non-null int64
Name           418 non-null object
Sex            418 non-null object
Age            332 non-null float64
SibSp          418 non-null int64
Parch          418 non-null int64
Ticket         418 non-null object
Fare           417 non-null float64
Cabin          91 non-null object
Embarked       418 non-null object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [10]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
PassengerId    891 non-null int64
Survived       891 non-null int64
Pclass         891 non-null int64
Name           891 non-null object
Sex            891 non-null object
Age            714 non-null float64
SibSp          891 non-null int64
Parch          891 non-null int64
Ticket         891 non-null object
Fare           891 non-null float64
Cabin          204 non-null object
Embarked       889 non-null object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.6+ KB

In [11]:
train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [12]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [13]:
test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

#補缺失值

In [14]:
selected_features =['Pclass','Age','SibSp','Parch','Fare','Sex','Embarked']

In [15]:
X_train = train[selected_features]

In [16]:
X_train.head()

   Pclass   Age  SibSp  Parch     Fare     Sex Embarked
0       3  22.0      1      0   7.2500    male        S
1       1  38.0      1      0  71.2833  female        C
2       3  26.0      0      0   7.9250  female        S
3       1  35.0      1      0  53.1000  female        S
4       3  35.0      0      0   8.0500    male        S

In [59]:
y_train = train['Survived']
y_test = submit['Survived']

In [64]:
y_train.head()
print("----------------------------")
y_test.head()

----------------------------

0    0
1    1
2    0
3    0
4    1
Name: Survived, dtype: int64

In [19]:
X_test = test[selected_features]
X_test.head()

   Pclass   Age  SibSp  Parch     Fare     Sex Embarked
0       3  34.5      0      0   7.8292    male        Q
1       3  47.0      1      0   7.0000  female        S
2       2  62.0      0      0   9.6875    male        Q
3       3  27.0      0      0   8.6625    male        S
4       3  22.0      1      1  12.2875  female        S

# 處理缺值

In [20]:
X_train['Age'].fillna(X_train['Age'].mean(),inplace = True)
X_test['Age'].fillna(X_test['Age'].mean(),inplace = True)
X_test['Fare'].fillna(X_train['Fare'].mean(), inplace = True)
X_train['Embarked'].fillna("S",inplace= True)

C:\Users\user\Anaconda3\lib\site-packages\pandas\core\generic.py:4355: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._update_inplace(new_data)

In [66]:
X_train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 7 columns):
Pclass      891 non-null int64
Age         891 non-null float64
SibSp       891 non-null int64
Parch       891 non-null int64
Fare        891 non-null float64
Sex         891 non-null int32
Embarked    891 non-null int64
dtypes: float64(2), int32(1), int64(4)
memory usage: 45.3 KB

In [67]:
X_test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 7 columns):
Pclass      418 non-null int64
Age         418 non-null float64
SibSp       418 non-null int64
Parch       418 non-null int64
Fare        418 non-null float64
Sex         418 non-null int32
Embarked    418 non-null int64
dtypes: float64(2), int32(1), int64(4)
memory usage: 21.3 KB

# XGboost classifier
#https://medium.com/@yehjames/%E8%B3%87%E6%96%99%E5%88%86%E6%9E%90-%E6%A9%9F%E5%99%A8%E5%AD%B8%E7%BF%92-%E7%AC%AC5-2%E8%AC%9B-kaggle%E6%A9%9F%E5%99%A8%E5%AD%B8%E7%BF%92%E7%AB%B6%E8%B3%BD%E7%A5%9E%E5%99%A8xgboost%E4%BB%8B%E7%B4%B9-1c8f55cffcc XGboost範例

In [26]:
from xgboost import XGBClassifier

In [85]:
xgbc = XGBClassifier()

TypeError: 'module' object is not callable

# pridction way1

In [91]:
gbm = xgb.XGBClassifier(
    #learning_rate = 0.02,
 n_estimators= 2000,
 max_depth= 4,
 min_child_weight= 2,
 #gamma=1,
 gamma=0.9,                        
 subsample=0.8,
 colsample_bytree=0.8,
 objective= 'binary:logistic',
 nthread= -1,
 scale_pos_weight=1).fit(X_train, y_train)
predictions = gbm.predict(X_test)

C:\Users\user\Anaconda3\lib\site-packages\sklearn\preprocessing\label.py:151: DeprecationWarning: The truth value of an empty array is ambiguous. Returning False, but in future this will result in an error. Use `array.size > 0` to check that an array is not empty.
  if diff:

# pridict way 2

In [98]:
y_pred = xgbc.fit(X_train,y_train).predict(X_test) ##注意數值是否為string ##順便predict

C:\Users\user\Anaconda3\lib\site-packages\sklearn\preprocessing\label.py:151: DeprecationWarning: The truth value of an empty array is ambiguous. Returning False, but in future this will result in an error. Use `array.size > 0` to check that an array is not empty.
  if diff:

In [90]:
len(y_pred)

418

# 改變標籤 http://scikit-learn.org/stable/modules/generated/sklearn.preprocessing.LabelEncoder.html

In [47]:
X_test.
X_test.Sex = (X_test.Sex == 'male' )*1

C:\Users\user\Anaconda3\lib\site-packages\pandas\core\generic.py:3643: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self[name] = value

In [45]:
X_train.head()

   Pclass   Age  SibSp  Parch     Fare  Sex Embarked
0       3  22.0      1      0   7.2500    1        S
1       1  38.0      1      0  71.2833    0        C
2       3  26.0      0      0   7.9250    0        S
3       1  35.0      1      0  53.1000    0        S
4       3  35.0      0      0   8.0500    1        S

In [48]:
X_test.head()

   Pclass   Age  SibSp  Parch     Fare  Sex Embarked
0       3  34.5      0      0   7.8292    1        Q
1       3  47.0      1      0   7.0000    0        S
2       2  62.0      0      0   9.6875    1        Q
3       3  27.0      0      0   8.6625    1        S
4       3  22.0      1      1  12.2875    0        S

In [56]:
le = preprocessing.LabelEncoder()
le.fit(X_train.Embarked)
X_train.Embarked=le.transform(X_train.Embarked)
le.fit(X_test.Embarked)
X_test.Embarked=le.transform(X_test.Embarked)

C:\Users\user\Anaconda3\lib\site-packages\pandas\core\generic.py:3643: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self[name] = value

In [57]:
X_train.head()

   Pclass   Age  SibSp  Parch     Fare  Sex  Embarked
0       3  22.0      1      0   7.2500    1         2
1       1  38.0      1      0  71.2833    0         0
2       3  26.0      0      0   7.9250    0         2
3       1  35.0      1      0  53.1000    0         2
4       3  35.0      0      0   8.0500    1         2

In [58]:
X_test.head()

   Pclass   Age  SibSp  Parch     Fare  Sex  Embarked
0       3  34.5      0      0   7.8292    1         1
1       3  47.0      1      0   7.0000    0         2
2       2  62.0      0      0   9.6875    1         1
3       3  27.0      0      0   8.6625    1         2
4       3  22.0      1      1  12.2875    0         2

# 搞一個submission 檔案

In [99]:
PassengerId = test.PassengerId
StackingSubmission = pd.DataFrame({ 'PassengerId': PassengerId,
                            'Survived': y_pred })
StackingSubmission.to_csv("Submission.csv", index=False)

In [102]:
StackingSubmission

     PassengerId  Survived
0            892         0
1            893         0
2            894         0
3            895         0
4            896         0
5            897         0
6            898         1
7            899         0
8            900         1
9            901         0
10           902         0
11           903         0
12           904         1
13           905         0
14           906         1
15           907         1
16           908         0
17           909         0
18           910         1
19           911         0
20           912         0
21           913         1
22           914         1
23           915         1
24           916         1
25           917         0
26           918         1
27           919         0
28           920         1
29           921         0
..           ...       ...
388         1280         0
389         1281         0
390         1282         0
391         1283         1
392         1284         0
393         1285         0
394         1286         0
395         1287         1
396         1288         0
397         1289         1
398         1290         0
399         1291         0
400         1292         1
401         1293         0
402         1294         1
403         1295         0
404         1296         0
405         1297         0
406         1298         0
407         1299         0
408         1300         1
409         1301         1
410         1302         1
411         1303         1
412         1304         1
413         1305         0
414         1306         1
415         1307         0
416         1308         0
417         1309         0

[418 rows x 2 columns]

In [ ]:
scores = cross_val_score(clf, iris.data, iris.target, cv=5)